In [1]:
import pandas as pd
import numpy as np

In [2]:
exam_data = {'이름': ['정수현', '윤웅익', '우성호', '김복희', '홍길동', '임꺽정', '이창신', '김완', '최영규', '한범석'],
'점수': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'응시횟수': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'합격여부': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [3]:
exam_data

{'이름': ['정수현', '윤웅익', '우성호', '김복희', '홍길동', '임꺽정', '이창신', '김완', '최영규', '한범석'],
 '점수': [12.5, 9, 16.5, nan, 9, 20, 14.5, nan, 8, 19],
 '응시횟수': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 '합격여부': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [4]:
labels=list( 'abcdefghij' )

In [5]:
labels

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [6]:
df = pd.DataFrame(exam_data, index=labels)

In [7]:
df

    이름    점수  응시횟수 합격여부
a  정수현  12.5     1  yes
b  윤웅익   9.0     3   no
c  우성호  16.5     2  yes
d  김복희   NaN     3   no
e  홍길동   9.0     2   no
f  임꺽정  20.0     3  yes
g  이창신  14.5     1  yes
h   김완   NaN     1   no
i  최영규   8.0     2   no
j  한범석  19.0     1  yes

In [8]:
df[df['응시횟수']<2]

    이름    점수  응시횟수 합격여부
a  정수현  12.5     1  yes
g  이창신  14.5     1  yes
h   김완   NaN     1   no
j  한범석  19.0     1  yes

In [9]:
df[df['점수']>15]

    이름    점수  응시횟수 합격여부
c  우성호  16.5     2  yes
f  임꺽정  20.0     3  yes
j  한범석  19.0     1  yes

In [10]:
df[ (df['응시횟수']<2) & (df['점수']>=15) ]

    이름    점수  응시횟수 합격여부
j  한범석  19.0     1  yes

In [11]:
df[ (df['응시횟수']>=2) & (df['점수']<10) ]

    이름   점수  응시횟수 합격여부
b  윤웅익  9.0     3   no
e  홍길동  9.0     2   no
i  최영규  8.0     2   no

In [12]:
# 프로그래밍 문제2
df.fillna(value=df.mean())

C:\Users\wjdrl\AppData\Local\Temp/ipykernel_9012/1364442528.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(value=df.mean())

    이름       점수  응시횟수 합격여부
a  정수현  12.5000     1  yes
b  윤웅익   9.0000     3   no
c  우성호  16.5000     2  yes
d  김복희  13.5625     3   no
e  홍길동   9.0000     2   no
f  임꺽정  20.0000     3  yes
g  이창신  14.5000     1  yes
h   김완  13.5625     1   no
i  최영규   8.0000     2   no
j  한범석  19.0000     1  yes

In [17]:
#프로그래밍 문제3
df.groupby('합격여부').count()

      이름  점수  응시횟수
합격여부
no     5   3     5
yes    5   5     5

In [ ]:
#프로그래밍 문제4